Tekla.Structures.Filtering.BinaryFilterExpression
The BinaryFilterExpression class represents a binary expression between two filter expressions.
This class cannot be inherited.
Tekla.Structures.Filtering.BinaryFilterExpressionCollection
The following example creates this BinaryFilterExpression:
PartName == BEAM1
using System;
using Tekla.Structures.Filtering;
using Tekla.Structures.Filtering.Categories;
public class FilterExample
{
// Creates a binary filter expression:
// PartName == BEAM1
public BinaryFilterExpression CreateBinaryFilterExpression()
{
// Creates the filter expressions
PartFilterExpressions.Name PartName = new PartFilterExpressions.Name();
StringConstantFilterExpression Beam1 = new StringConstantFilterExpression("BEAM1");
// Creates the binary filter expression
return new BinaryFilterExpression(PartName, StringOperatorType.IS_EQUAL, Beam1);
}
}

Tekla.Structures.Filtering.BinaryFilterExpression.#ctor(Tekla.Structures.Filtering.DataFilterExpression,Tekla.Structures.Filtering.OperatorType,Tekla.Structures.Filtering.DataFilterExpression)
Initializes a new instance of the BinaryFilterExpression class.
Left: The left operand of the filter expression.
Oper: The operator of the filter expression.
Right: The right operand of the filter expression.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpression.#ctor(Tekla.Structures.Filtering.BooleanFilterExpression,Tekla.Structures.Filtering.BooleanOperatorType,Tekla.Structures.Filtering.BooleanConstantFilterExpression)
Initializes a new instance of the BinaryFilterExpression class.
Left: The left operand of the filter expression.
Oper: The operator of the filter expression.
Right: The right operand of the filter expression.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpression.#ctor(Tekla.Structures.Filtering.StringFilterExpression,Tekla.Structures.Filtering.StringOperatorType,Tekla.Structures.Filtering.StringConstantFilterExpression)
Initializes a new instance of the BinaryFilterExpression class.
Left: The left operand of the filter expression.
Oper: The operator of the filter expression.
Right: The right operand of the filter expression.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpression.#ctor(Tekla.Structures.Filtering.NumericFilterExpression,Tekla.Structures.Filtering.NumericOperatorType,Tekla.Structures.Filtering.NumericConstantFilterExpression)
Initializes a new instance of the BinaryFilterExpression class.
Left: The left operand of the filter expression.
Oper: The operator of the filter expression.
Right: The right operand of the filter expression.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpression.#ctor(Tekla.Structures.Filtering.DateTimeFilterExpression,Tekla.Structures.Filtering.DateTimeOperatorType,Tekla.Structures.Filtering.DateTimeConstantFilterExpression)
Initializes a new instance of the BinaryFilterExpression class.
Left: The left operand of the filter expression.
Oper: The operator of the filter expression.
Right: The right operand of the filter expression.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpression.Left
Gets or sets the left operand of the filter expression.

Tekla.Structures.Filtering.BinaryFilterExpression.Operator
Gets or sets the operator of the filter expression.

Tekla.Structures.Filtering.BinaryFilterExpression.Right
Gets or sets the right operand of the filter expression.